# St7SetBrickLocalAxes1

Aligns the brick local axis system with the specified UCS. See Brick Local Coordinates for additional information.

long St7SetBrickLocalAxes1(long uID, long BrickNum, long UCSId)

Input Parameters

uID

Strand7 model file ID.

BrickNum

Brick number.

UCSId

ID number of the specified UCS. UCSId = 1 refers to the global XYZ system.